app/views/profiles/show.html.erb


<% @profile.events.each do |event| %>
---
SELECT `events`.* FROM `events` WHERE `events`.`profile_id` = 1 ORDER BY created_at DESC