app/views/events/search.html.erb


      <h2>Categories: <%= event.categories.map { |c| c.name}.join(', ') %></h2>
---
SELECT `categories`.* FROM `categories` INNER JOIN `categories_events` ON `categories`.`id` = `categories_events`.`category_id` WHERE `categories_events`.`event_id` = 8