app/controllers/events_controller.rb

SELECT `events`.* FROM `events` WHERE `events`.`profile_id` = 5 ORDER BY created_at DESC
---
  def my_events
    unless current_user.profile == nil
      @my_events = Event.where(profile_id: current_user.profile.id).order("created_at DESC")

SELECT `categories`.* FROM `categories`
---
	def new
		if current_user.profile == nil
  		flash[:notice] = 'You can not create a event because you do not have a profile yet'
  		redirect_to profiles_path
  	else
			@event = Event.new
      @categories = Category.all

INSERT INTO `events` (`title`, `description`, `time`, `location`, `created_at`, `updated_at`, `latitude`, `longitude`) VALUES ('soccer', 'soccer game', '2016-05-06 03:55:00', 'sunset park', '2016-09-18 19:52:31', '2016-09-18 19:52:31', 40.645532, -74.0123851)
UPDATE `events` SET `profile_id` = 4 WHERE `events`.`id` = 10
---
	def create

 		@event =  Event.create(event_params)
 		@event.profile_id = current_user.profile.id


  	if @event.save

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`event_id` = 10
---
	def show
    @reviews = Review.where(event_id: @event.id)

SELECT `categories`.* FROM `categories`
---
  def edit
    @categories = Category.all

UPDATE `events` SET `latitude` = 40.6781784, `longitude` = -73.9441579, `updated_at` = '2016-09-18 20:20:20' WHERE `events`.`id` = 9
---
  def update
    if @event.update(event_params)