app/controllers/profiles_controller.rb

SELECT `profiles`.* FROM `profiles`
---
  def index
    @profiles = Profile.all

SELECT `categories`.* FROM `categories`
---
	def new
    if current_user.profile != nil
      flash[:notice] = 'You can not create another profile because you already have a profile'
      redirect_to profiles_path
    else
    	@profile = current_user.build_profile
      @categories = Category.all

INSERT INTO `profiles` (`name`, `user_id`, `created_at`, `updated_at`) VALUES ('Jay', 1, '2016-08-20 06:55:49', '2016-08-20 06:55:49')
UPDATE `profiles` SET `user_id` = NULL, `updated_at` = '2016-08-20 06:57:44' WHERE `profiles`.`id` = 1
---
  def create
    @profile = current_user.build_profile(profile_params)

    if @profile.save

SELECT `categories`.* FROM `categories`
---
  def edit
    @categories = Category.all

UPDATE `profiles` SET `profile_pic_file_name` = 'Cat_thumnail.jpg', `profile_pic_content_type` = 'image/jpeg', `profile_pic_file_size` = 21385, `profile_pic_updated_at` = '2016-09-13 17:43:48', `updated_at` = '2016-09-13 17:43:48' WHERE `profiles`.`id` = 2
---
  def update
    if @profile.update(profile_params)

SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 2 LIMIT 1
---
  def set_profile
  	@profile = Profile.find(params[:id])