app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review = current_user.reviews.build(review_params)
    @review.event_id = @event.id

    respond_to do |format|
      if @review.save
---
INSERT INTO `reviews` (`score`, `comment`, `created_at`, `updated_at`, `user_id`, `event_id`) VALUES (5, 'ok', '2016-09-15 03:05:13', '2016-09-15 03:05:13', 3, 9)

    def set_event
      @event = Event.find(params[:event_id])
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = 9 LIMIT 1