app/views/categories/show.html.erb

SELECT `events`.* FROM `events` INNER JOIN `categories_events` ON `events`.`id` = `categories_events`.`event_id` WHERE `categories_events`.`category_id` = 1
---
<h2>Events:</h2>
<% @category.events.each do |event| %>

SELECT `profiles`.* FROM `profiles` INNER JOIN `categories_profiles` ON `profiles`.`id` = `categories_profiles`.`profile_id` WHERE `categories_profiles`.`category_id` = 1
---
<h2>Profiles:</h2>
<% @category.profiles.each do |profile| %>